In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('banglore_home_price_data.csv')
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
df.tail()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.0
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.0
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [4]:
df.shape

(13320, 9)

In [5]:
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [6]:
df.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [7]:
df.groupby('availability')['availability'].agg('count')

availability
14-Jul                      1
14-Nov                      1
15-Aug                      1
15-Dec                      1
15-Jun                      1
                        ...
22-Mar                      3
22-May                     10
22-Nov                      2
Immediate Possession       16
Ready To Move           10581
Name: availability, Length: 81, dtype: int64

In [8]:
df.groupby('location')['location'].agg('count')

location
 Anekal                 1
 Banaswadi              1
 Basavangudi            1
 Bhoganhalli            1
 Devarabeesana Halli    6
                       ..
t.c palya               1
tc.palya                4
vinayakanagar           1
white field,kadugodi    1
whitefiled              1
Name: location, Length: 1305, dtype: int64

In [9]:
df.groupby('society')['society'].agg('count')

society
3Codeli    2
7 ise P    1
A idse     2
A rtsai    1
ACersd     1
          ..
Zonce E    2
Zostaa     3
i1ncyRe    1
i1odsne    1
i1rtsCo    3
Name: society, Length: 2688, dtype: int64

## Drop columns which are not numerically impacting the ML model for the sake of simplicity: drop()

In [13]:
df1 = df.drop(['area_type', 'availability', 'location', 'society'], axis = 'columns')
df1.head()

        size total_sqft  bath  balcony   price
0      2 BHK       1056   2.0      1.0   39.07
1  4 Bedroom       2600   5.0      3.0  120.00
2      3 BHK       1440   2.0      3.0   62.00
3      3 BHK       1521   3.0      1.0   95.00
4      2 BHK       1200   2.0      1.0   51.00

## Data Cleaning: isnull().sum(); handling missing values: drop(), fillna() 

#### DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)..

In [14]:
df1.isnull().sum()

size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [17]:
df2 = df1['size'].dropna()

In [19]:
df2.isnull().sum()

0

In [20]:
df2.head()

0        2 BHK
1    4 Bedroom
2        3 BHK
3        3 BHK
4        2 BHK
Name: size, dtype: object

In [21]:
df2.shape

(13304,)

In [22]:
df1.shape

(13320, 5)

In [23]:
df1.head()

        size total_sqft  bath  balcony   price
0      2 BHK       1056   2.0      1.0   39.07
1  4 Bedroom       2600   5.0      3.0  120.00
2      3 BHK       1440   2.0      3.0   62.00
3      3 BHK       1521   3.0      1.0   95.00
4      2 BHK       1200   2.0      1.0   51.00

In [24]:
df1.isnull().sum()

size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [25]:
df1.dropna(how = 'all')

            size total_sqft  bath  balcony   price
0          2 BHK       1056   2.0      1.0   39.07
1      4 Bedroom       2600   5.0      3.0  120.00
2          3 BHK       1440   2.0      3.0   62.00
3          3 BHK       1521   3.0      1.0   95.00
4          2 BHK       1200   2.0      1.0   51.00
...          ...        ...   ...      ...     ...
13315  5 Bedroom       3453   4.0      0.0  231.00
13316      4 BHK       3600   5.0      NaN  400.00
13317      2 BHK       1141   2.0      1.0   60.00
13318      4 BHK       4689   4.0      1.0  488.00
13319      1 BHK        550   1.0      1.0   17.00

[13320 rows x 5 columns]

In [26]:
df1.isnull().sum()

size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [27]:
df3 = df1.dropna()

In [28]:
df3.isnull().sum()

size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [30]:
df3.shape

(12711, 5)

In [31]:
df1.shape

(13320, 5)

In [35]:
df1['balcony'].fillna(1, inplace = True)

In [36]:
df1.isnull().sum()

size          16
total_sqft     0
bath          73
balcony        0
price          0
dtype: int64

In [38]:
df1['bath'].fillna(df1.bath.median(), inplace = True)

In [39]:
df1.isnull().sum()

size          16
total_sqft     0
bath           0
balcony        0
price          0
dtype: int64

In [40]:
df1.dropna(inplace = True)

In [41]:
df1.isnull().sum()

size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [42]:
df1.shape

(13304, 5)

In [44]:
df1['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [46]:
df1['bhk'] = df1['size'].apply(lambda x: int(x.split(' ')[0]))

In [47]:
df1.head()

        size total_sqft  bath  balcony   price  bhk
0      2 BHK       1056   2.0      1.0   39.07    2
1  4 Bedroom       2600   5.0      3.0  120.00    4
2      3 BHK       1440   2.0      3.0   62.00    3
3      3 BHK       1521   3.0      1.0   95.00    3
4      2 BHK       1200   2.0      1.0   51.00    2

In [48]:
df1['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [49]:
df1[df1.bhk>20]

            size total_sqft  bath  balcony  price  bhk
1718      27 BHK       8000  27.0      0.0  230.0   27
4684  43 Bedroom       2400  40.0      0.0  660.0   43

In [50]:
df1['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [51]:
df1['bath'].unique()

array([ 2.,  5.,  3.,  4.,  6.,  1.,  9.,  8.,  7., 11., 10., 14., 27.,
       12., 16., 40., 15., 13., 18.])

In [52]:
df1['price'].unique()

array([ 39.07, 120.  ,  62.  , ...,  40.14, 231.  , 488.  ])

In [54]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [58]:
df1[29:32]

     size   total_sqft  bath  balcony  price  bhk
29  3 BHK         1025   2.0      1.0   47.0    3
30  4 BHK  2100 - 2850   4.0      0.0  186.0    4
31  3 BHK         1075   2.0      1.0   35.0    3

In [59]:
df1.iloc[30]

size                4 BHK
total_sqft    2100 - 2850
bath                    4
balcony                 0
price                 186
bhk                     4
Name: 30, dtype: object

In [60]:
is_float(2100 - 2850)

True

In [61]:
is_float(1025)

True

In [56]:
df1[~df['total_sqft'].apply(is_float)]

/home/vins/Workspace/Py/python/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

            size   total_sqft  bath  balcony    price  bhk
30         4 BHK  2100 - 2850   4.0      0.0  186.000    4
56     4 Bedroom  3010 - 3410   2.0      1.0  192.000    4
81     4 Bedroom  2957 - 3450   2.0      1.0  224.500    4
122        4 BHK  3067 - 8156   4.0      0.0  477.000    4
137        2 BHK  1042 - 1105   2.0      0.0   54.005    2
...          ...          ...   ...      ...      ...  ...
12990      3 BHK  1804 - 2273   3.0      0.0  122.000    3
13059      2 BHK  1200 - 1470   2.0      0.0   72.760    2
13240      1 BHK  1020 - 1130   2.0      1.0   52.570    1
13265      2 BHK  1133 - 1384   2.0      0.0   59.135    2
13299      4 BHK  2830 - 2882   5.0      0.0  154.500    4

[239 rows x 6 columns]

In [57]:
df1[~df['total_sqft'].apply(is_float)].head(15)

/home/vins/Workspace/Py/python/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

          size      total_sqft  bath  balcony    price  bhk
30       4 BHK     2100 - 2850   4.0      0.0  186.000    4
56   4 Bedroom     3010 - 3410   2.0      1.0  192.000    4
81   4 Bedroom     2957 - 3450   2.0      1.0  224.500    4
122      4 BHK     3067 - 8156   4.0      0.0  477.000    4
137      2 BHK     1042 - 1105   2.0      0.0   54.005    2
165      2 BHK     1145 - 1340   2.0      0.0   43.490    2
188      2 BHK     1015 - 1540   2.0      0.0   56.800    2
224      3 BHK     1520 - 1740   2.0      1.0   74.820    3
410      1 BHK  34.46Sq. Meter   1.0      0.0   18.500    1
549      2 BHK     1195 - 1440   2.0      0.0   63.770    2
648  9 Bedroom       4125Perch   9.0      1.0  265.000    9
661      2 BHK     1120 - 1145   2.0      0.0   48.130    2
669      5 BHK     4400 - 6640   2.0      1.0  375.000    5
672  4 Bedroom     3090 - 5002   4.0      0.0  445.000    4
702      5 BHK     4400 - 6800   2.0      1.0  548.500    5

In [63]:
df1.iloc[410], df1.iloc[648]

(size                   1 BHK
 total_sqft    34.46Sq. Meter
 bath                       1
 balcony                    0
 price                   18.5
 bhk                        1
 Name: 410, dtype: object,
 size          3 BHK
 total_sqft     2378
 bath              3
 balcony           1
 price           262
 bhk               3
 Name: 649, dtype: object)

In [128]:
def convert_sqrt_to_num(x):
    tockens = x.split('-')
    if len(tockens)==2:
        return (float(tockens[0]) + float(tockens[1]))/2
    try:
        return float(x)
    except:
        return None

In [107]:
convert_sqrt_to_num('2900')

['2900']

2900.0

In [108]:
convert_sqrt_to_num('203000')

['203000']

203000.0

In [125]:
convert_sqrt_to_num('34.46Sq. Meter')

In [126]:
convert_sqrt_to_num('4400 - 6800')

5600.0

In [119]:
df1.shape

(13304, 6)

In [117]:
df1.isnull().sum()

size          0
total_sqft    0
bath          0
balcony       0
price         0
bhk           0
dtype: int64

In [118]:
df4 = df1.copy()

In [120]:
df4.shape

(13304, 6)

In [121]:
df4.isnull().sum()

size          0
total_sqft    0
bath          0
balcony       0
price         0
bhk           0
dtype: int64

In [136]:
def convert_sqft_to_num(x):
    tockens = x.split('-')
    if len(tockens) == 2:
        return (float(tockens[0]) + float(tockens[1]))/2
    try:
        return float(x)
    
    except 'AttributeError':
        return None

In [137]:
df4['total_sqft'] = df4['total_sqft'].apply(convert_sqft_to_num)
df4.head()

AttributeError: 'float' object has no attribute 'split'